mosagepa/TM4C1294-PWM-Controller/main.c

/*
  main_V24.c - FINAL: Your working PWM + simple UART from uart_echo.c pattern

  Based on your working pwm.c:
  - PWM setup and update logic EXACTLY as in pwm.c (no disable/enable on updates)
  - Simple ISR-based UART echo + line accumulation (like uart_echo.c)
  - DTR session detection on PQ1
  - PSYN command parsing

  NO complex line editor, NO FIFO, NO diagnostics overhead.
  Just clean, working code.

  Build: requires TivaWare DriverLib.
*/

#define _POSIX_C_SOURCE 200809L

#include <stdio.h>
#include <stdint.h>
#include <stdbool.h>
#include <string.h>
#include <stdlib.h>
//#include <ctype.h>

#include <stddef.h>   /* for ptrdiff_t */

/* prototype for newlib/syscalls _sbrk */
extern void * _sbrk(ptrdiff_t incr);


/* Custom functions for command line processing via UART
   and re-implementing typical newlib-style printf's and
   sprintf's via our own lightweight UART output helpers... */
#include "cmdline.h"

// Other libc-related custom helpers and callbacks
#include "ctype_helpers.h"
#include "strtok_compat.h"

// Custom debug helpers to help
// diagnose memory allocations and all that
#include "diag_uart.h"

#include "ui_uart3.h"
#include "commands.h"

#include "inc/hw_ints.h"
#include "inc/hw_memmap.h"
#include "inc/hw_types.h"
#include "inc/hw_nvic.h"

#include "driverlib/debug.h"
#include "driverlib/gpio.h"
#include "driverlib/interrupt.h"
#include "driverlib/pin_map.h"
#include "driverlib/rom.h"
#include "driverlib/rom_map.h"
#include "driverlib/sysctl.h"
#include "driverlib/uart.h"
#include "driverlib/pwm.h"
#include "drivers/pinout.h"
#include "utils/uartstdio.h"

#include "utils/ustdlib.h"

#include "timebase.h"
#include "tach.h"
#include "tsyn.h"


uint32_t g_ui32SysClock;


/* Configs at MAIN level (avoid declaring UART-comm constants here,
   those will be better place within 'cmdline.h' ... */ 
#define TARGET_PWM_FREQ_HZ 21500U
#define TARGET_DUTY_PERCENT_INIT 30U
#define PSYN_MIN 5
#define PSYN_MAX 96

/* DTR detection pin (PQ1) */
#define DTR_PORT GPIO_PORTQ_BASE
#define DTR_PIN  GPIO_PIN_1

/* PWM globals - as in your working pwm.c */
static uint32_t g_pwmPeriod = 0;
static uint32_t g_pwmPulse  = 0;
static bool g_pwm_enabled = true;
static uint32_t g_pwm_percent_requested = TARGET_DUTY_PERCENT_INIT;

/* UART RX buffer - simple accumulator */
static volatile char user_rx_buf[UART_RX_BUF_SIZE];

static volatile uint32_t user_rx_len = 0;
static volatile bool user_cmd_ready = false;

/* Hidden keystroke feature: 5 consecutive 'P' typed on UART3 triggers UART0 GOTCHA. */
static volatile uint8_t g_uart3_p_run = 0;
static volatile bool g_uart3_gotcha_pending = false;
static const char g_uart0_gotcha_msg[] = "\r\nGOTCHA: PPPPP detected on UART3\r\n";

/* Software-requested close of the UART3 session (EXIT command). */
static volatile bool g_uart3_force_disconnect = false;
/* When a software EXIT closes the session, require a DTR release (idle/high)
    before allowing a new session to begin. This prevents immediate auto-reopen
    when the host keeps DTR asserted. */
static volatile bool g_uart3_require_dtr_release = false;
static volatile bool g_uart3_sw_disconnect_requested = false;

static void flash_pf4_gotcha(uint32_t flashes)
{
    /* PF4 is already configured as GPIO output in setup_uarts(). */
    const uint32_t delay_ticks = g_ui32SysClock / 40U; /* ~75ms at 120MHz (SysCtlDelay loop is ~3 cycles) */
    for (uint32_t i = 0; i < flashes; i++) {
        ROM_GPIOPinWrite(GPIO_PORTF_BASE, GPIO_PIN_4, GPIO_PIN_4);
        SysCtlDelay(delay_ticks);
        ROM_GPIOPinWrite(GPIO_PORTF_BASE, GPIO_PIN_4, 0);
        SysCtlDelay(delay_ticks);
    }
}

/* UART0 diagnostics gating (default OFF). */
static volatile bool g_debug_enabled = false;

void debug_set_enabled(bool enabled)
{
    g_debug_enabled = enabled;
}

bool debug_is_enabled(void)
{
    return g_debug_enabled;
}

void uart3_request_disconnect(void)
{
    g_uart3_force_disconnect = true;
    g_uart3_sw_disconnect_requested = true;
}

/* Forward declarations */
static void setup_system_clock(void);
static void setup_pwm_pf2(void);
static void set_pwm_percent(uint32_t percent);
static void setup_uarts(void);
static void process_user_line(const char *line);
static void user_uart3_consume_pending_input(void);

/* Expose PWM setter to higher-level command module without changing ISR logic. */
void pwm_set_percent(uint32_t percent)
{
    g_pwm_percent_requested = percent;
    set_pwm_percent(percent);
}

uint32_t pwm_get_percent_requested(void)
{
    return g_pwm_percent_requested;
}

void pwm_set_enabled(bool enabled)
{
    if (enabled) {
        /* Restore PF2 to PWM function and enable output. */
        GPIOPinConfigure(GPIO_PF2_M0PWM2);
        GPIOPinTypePWM(GPIO_PORTF_BASE, GPIO_PIN_2);
        PWMPulseWidthSet(PWM0_BASE, PWM_OUT_2, g_pwmPulse);
        PWMOutputState(PWM0_BASE, PWM_OUT_2_BIT, true);
        g_pwm_enabled = true;
        return;
    }

    /* Disable PWM output and force PF2 low for clean scope viewing. */
    PWMOutputState(PWM0_BASE, PWM_OUT_2_BIT, false);
    GPIOPinTypeGPIOOutput(GPIO_PORTF_BASE, GPIO_PIN_2);
    GPIOPinWrite(GPIO_PORTF_BASE, GPIO_PIN_2, 0);
    g_pwm_enabled = false;
}

bool pwm_is_enabled(void)
{
    return g_pwm_enabled;
}


/* ICDI UART0 ISR - echo only */
void ICDIUARTIntHandler(void)
{
    uint32_t ui32Status = ROM_UARTIntStatus(UART0_BASE, true);

    ROM_UARTIntClear(UART0_BASE, ui32Status);

    while (ROM_UARTCharsAvail(UART0_BASE)) {

        ROM_UARTCharPutNonBlocking(UART0_BASE, ROM_UARTCharGetNonBlocking(UART0_BASE));
        GPIOPinWrite(GPIO_PORTN_BASE, GPIO_PIN_0, GPIO_PIN_0);
        SysCtlDelay(g_ui32SysClock / (1000 * 3));
        GPIOPinWrite(GPIO_PORTN_BASE, GPIO_PIN_0, 0);

    }

}


/* USER UART3 ISR - echo + accumulate, exactly as in your pwm.c */
void USERUARTIntHandler(void)
{
    uint32_t ui32Status = ROM_UARTIntStatus(UART3_BASE, true);

    ROM_UARTIntClear(UART3_BASE, ui32Status);

    while (ROM_UARTCharsAvail(UART3_BASE)) {

        uint8_t c = ROM_UARTCharGetNonBlocking(UART3_BASE);

        if (user_cmd_ready) {
            /* Ignore extra RX bytes until main loop consumes the line. */
            continue;
        }

        /* Handle backspace/delete locally (do not allow erasing prompt). */
        if (c == '\b' || c == 0x7FU) {
            g_uart3_p_run = 0;
            if (user_rx_len > 0) {
                user_rx_len--;
                ROM_UARTCharPutNonBlocking(UART3_BASE, '\b');
                ROM_UARTCharPutNonBlocking(UART3_BASE, ' ');
                ROM_UARTCharPutNonBlocking(UART3_BASE, '\b');
            } else {
                /* Bell if user tries to backspace past prompt. */
                ROM_UARTCharPutNonBlocking(UART3_BASE, '\a');
            }
            continue;
        }

        /* Enter handling */
        if ((char)c == '\r' || (char)c == '\n') {
            g_uart3_p_run = 0;
            if (user_rx_len > 0) {
                /* Echo newline once, finalize command. */
                ROM_UARTCharPutNonBlocking(UART3_BASE, '\r');
                ROM_UARTCharPutNonBlocking(UART3_BASE, '\n');
                user_rx_buf[user_rx_len] = '\0';
                user_cmd_ready = true;
            } else {
                /* Empty line: do NOTHING (no extra newline, no extra prompt). */
            }
            continue;
        }

        /* Uppercase-as-you-type for printable letters (ESP32-style). */
        if (c >= 'a' && c <= 'z') {
            c = (uint8_t)(c - 'a' + 'A');
        }

        /* Hidden GOTCHA: trigger immediately on 5 consecutive 'P' keystrokes. */
        if (c == 'P') {
            if (g_uart3_p_run < 5) {
                g_uart3_p_run++;
            }
            if (g_uart3_p_run == 5) {
                g_uart3_gotcha_pending = true;
                /* Restart counting so long runs only trigger every 5. */
                g_uart3_p_run = 0;
            }
        } else {
            g_uart3_p_run = 0;
        }

        /* Echo normal characters immediately */
        ROM_UARTCharPutNonBlocking(UART3_BASE, c);

        /* Toggle PF4 LED on each received byte */
        static uint8_t led = 0;
        led = !led;
        ROM_GPIOPinWrite(GPIO_PORTF_BASE, GPIO_PIN_4, led ? GPIO_PIN_4 : 0);

        if (user_rx_len + 1 < UART_RX_BUF_SIZE) {
            user_rx_buf[user_rx_len++] = (char)c;
        } else {
            /* Overflow - reset */
            user_rx_len = 0;
            g_uart3_p_run = 0;
            const char *err = "\r\nERROR: line too long\r\n> ";
            while (*err) ROM_UARTCharPutNonBlocking(UART3_BASE, *err++);
        }
    }

